fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Добавляет команду создания документа "Реализация товаров и услуг" на основании
// текущего объекта (например, на основании заказа покупателя или счета).
//
// Параметры:
//  КомандыСозданияНаОсновании - тип - Коллекция - коллекция команд создания на основании,
//                                           в которую добавляется новая команда.
//
//  Возвращаемое значение:
//  тип - КомандаСоздатьНаОсновании - Структура - описание добавленной команды.
//  Неопределено - если у пользователя нет прав на добавление документа.
//  
// Описание:
//  Функция добавляет в подсистему "Ввод на основании" возможность создания
//  документа "Реализация товаров и услуг" из текущего документа.
//  Перед добавлением проверяются права пользователя на создание документа.
//
// Использование:
//  Вызывается из обработчика "ПриОпределенииКомандСозданияНаОсновании"
//  модуля менеджера документа.
//
// Пример:
//  Если ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) <> Неопределено Тогда
//      // Команда успешно добавлена
//  КонецЕсли;
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

// Устанавливает настройки печати для объекта.
//
// Параметры:
//  НастройкиОбъекта - Структура - настройки объекта метаданных, в которых
//                                  определяются параметры печати.
//
// Описание:
//  Процедура предназначена для управления видимостью команд печати в интерфейсе
//  объекта. Устанавливает флаг, определяющий, будут ли добавляться команды
//  печати в контекстное меню и панель инструментов объекта.
//
Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт
	// Включаем добавление команд печати для текущего объекта
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
КонецПроцедуры


// Добавляет команды печати в интерфейс документа.
//
// Параметры:
//  КомандыПечати - тип -Коллекция команд печати, в которую добавляются новые команды.
//
// Описание:
//  Процедура предназначена для добавления доступных печатных форм в контекстное меню
//  и панель команд документа. Регистрируются все необходимые печатные формы,
//  связанные с текущим документом.
//
// Пример:
//  ДобавитьКомандыПечати(КомандыПечати);
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//++Симбирёва О.С 24.06.26
	
	//Акт об оказанных услугах
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктОбОказанныхУслугах";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказанных услугах'");
	КомандаПечати.Порядок = 5;
	
	//--Симбирёва О.С 24.06.26
	
КонецПроцедуры

// Формирует печатные формы для переданных объектов документа.
//
// Параметры:
//  МассивОбъектов - тип - Массив - ссылки на документы, для которых необходимо
//                             сформировать печатные формы.
//  ПараметрыПечати - тип - Структура - дополнительные параметры печати (заполняется
//                                подсистемой печати, может быть пустым).
//  КоллекцияПечатныхФорм - тип - Коллекция - содержит доступные печатные формы,
//                                      каждая форма имеет уникальный идентификатор.
//  ОбъектыПечати - Структура - содержит объекты для заполнения макета
//                              (заполняется перед вызовом процедуры).
//  ПараметрыВывода - Структура - параметры вывода готового документа
//                                (например, количество копий).
//
// Описание:
//  Процедура обрабатывает коллекцию печатных форм, и для каждой доступной формы
//  вызывает соответствующую функцию формирования печатного документа.
//  Сгенерированный табличный документ помещается в коллекцию для дальнейшего
//  отображения пользователю или вывода на печать.
//
// Доступные печатные формы:
//     Макет: Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОбОказанныхУслугах
//
// Пример использования в подсистеме печати:
//   УправлениеПечатью.ВывестиНаПечать(Документы, ПараметрыПечати, "АктОбОказанныхУслугах");
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//++Симбирёва О.С 24.06.26
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктОбОказанныхУслугах");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьАктаОбОказанныхУслугах(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт об оказанных услугах'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОбОказанныхУслугах";
	КонецЕсли;
	
	//--Симбирёва О.С 24.06.26
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПечатьАктаОбОказанныхУслугах(МассивОбъектов, ОбъектыПечати)
	
	//++Симбирёва О.С 24.06.26
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктОбОказанныхУслугах";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОбОказанныхУслугах");

	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);

	ПервыйДокумент = Истина;

	Пока ДанныеДокументов.Следующий() Цикл

		Если Не ПервыйДокумент Тогда
			
			// Все документы нужно выводить на разных страницах.
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВывестиЗаголовокАктаОбОказанныхУслугах(ДанныеДокументов, ТабличныйДокумент, Макет);
		
		ВывестиТаблицу(ДанныеДокументов, ТабличныйДокумент, Макет);
		
		ВывестиПодвал(ДанныеДокументов, ТабличныйДокумент, Макет);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати,
			ДанныеДокументов.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;
	
	//--Симбирёва О.С 24.06.26
	
КонецФункции   

Функция ПолучитьДанныеДокументов(МассивОбъектов)
	
	//++Симбирёва О.С 24.06.26
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Номер КАК Номер,
	|	РеализацияТоваровУслуг.Дата КАК Дата,
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК Договор,
	|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	РеализацияТоваровУслуг.Товары.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма) КАК Товары,
	|	РеализацияТоваровУслуг.Услуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Номенклатура КАК Номенклатура,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма) КАК Услуги
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Возврат Запрос.Выполнить().Выбрать();
	
	//--Симбирёва О.С 24.06.26
	
КонецФункции

Процедура ВывестиЗаголовокАктаОбОказанныхУслугах(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	//++Симбирёва О.С 24.06.26
	
	ОбластьЗаголовокДокумента = Макет.ПолучитьОбласть("Заголовок");

	ДанныеПечати = Новый Структура;
	
	ШаблонЗаголовка = "Акт об оказанных услугах %1 от %2";
	ТекстЗаголовка = СтрШаблон(ШаблонЗаголовка,
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер),
		Формат(ДанныеДокументов.Дата, "ДЛФ=DD"));
	
	ДанныеПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
	ДанныеПечати.Вставить("Организация", ДанныеДокументов.Организация);
	ДанныеПечати.Вставить("Контрагент", ДанныеДокументов.Контрагент);
	ДанныеПечати.Вставить("Договор", ДанныеДокументов.Договор);
	
	ОбластьЗаголовокДокумента.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(ОбластьЗаголовокДокумента);
	
	ОбластьОтступ = Макет.ПолучитьОбласть("Отступ");
	ТабличныйДокумент.Вывести(ОбластьОтступ);

	//--Симбирёва О.С 24.06.26
	
КонецПроцедуры

Процедура ВывестиТаблицу(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	//++Симбирёва О.С 24.06.26
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ВыборкаУслуги = ДанныеДокументов.Услуги.Выбрать();
	
	Пока ВыборкаУслуги.Следующий() Цикл
		ОбластьСтрока.Параметры.Заполнить(ВыборкаУслуги);
		ТабличныйДокумент.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("Всего", ДанныеДокументов.СуммаДокумента);
	
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(ОбластьИтого); 
	
	//--Симбирёва О.С 24.06.26
	
КонецПроцедуры

Процедура ВывестиПодвал(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	//++Симбирёва О.С 24.06.26
	
	ОбластьСумма = Макет.ПолучитьОбласть("Сумма");
	СуммаПрописью = ЧислоПрописью(ДанныеДокументов.СуммаДокумента,"Л=ru_RU; ДП=Истина", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("СуммаПрописью", СуммаПрописью);
	ОбластьСумма.Параметры.Заполнить(ДанныеПечати);
	
	ТабличныйДокумент.Вывести(ОбластьСумма);

	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
	//--Симбирёва О.С 24.06.26
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
